#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_route53_zone.thomaskimble_zone: Reading...
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble: Refreshing state... [id=Z0521747TTLHC74FLK9Z]
aws_acm_certificate.thomaskimble_certificate[1]: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/2a4f09a5-832c-44bb-9406-0490f924567b]
aws_acm_certificate.thomaskimble_certificate[0]: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/34d6794e-a4c9-49e9-ab90-413b6902e80d]
data.aws_route53_zone.thomaskimble_zone: Read complete after 0s [id=Z0521747TTLHC74FLK9Z]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d2er6jry7l1se1]
aws_amplify_branch.dev: Refreshing state... [id=d2er6jry7l1se1/dev]
aws_amplify_branch.main: Refreshing state... [id=d2er6jry7l1se1/main]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d2er6jry7l1se1/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate_validation.thomaskimble_certificate_validation["*.thomaskimble.com"] will be created
  + resource "aws_acm_certificate_validation" "thomaskimble_certificate_validation" {
      + certificate_arn         = "arn:aws:acm:eu-west-1:287212251408:certificate/2a4f09a5-832c-44bb-9406-0490f924567b"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_acm_certificate_validation.thomaskimble_certificate_validation["thomaskimble.com"] will be created
  + resource "aws_acm_certificate_validation" "thomaskimble_certificate_validation" {
      + certificate_arn         = "arn:aws:acm:eu-west-1:287212251408:certificate/34d6794e-a4c9-49e9-ab90-413b6902e80d"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.thomaskimble_records["*.thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com"
      + records         = [
          + "_cd3cd79ea410f6996641975bc91f47a1.sdgjtdhdhz.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0521747TTLHC74FLK9Z"
    }

  # aws_route53_record.thomaskimble_records["thomaskimble.com"] will be created
  + resource "aws_route53_record" "thomaskimble_records" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com"
      + records         = [
          + "_cd3cd79ea410f6996641975bc91f47a1.sdgjtdhdhz.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z0521747TTLHC74FLK9Z"
    }

  # aws_route53_zone.thomaskimble will be destroyed
  # (because aws_route53_zone.thomaskimble is not in configuration)
  - resource "aws_route53_zone" "thomaskimble" {
      - arn                 = "arn:aws:route53:::hostedzone/Z0521747TTLHC74FLK9Z" -> null
      - comment             = "Managed by Terraform" -> null
      - force_destroy       = false -> null
      - id                  = "Z0521747TTLHC74FLK9Z" -> null
      - name                = "thomaskimble.com" -> null
      - name_servers        = [
          - "ns-1378.awsdns-44.org",
          - "ns-1882.awsdns-43.co.uk",
          - "ns-507.awsdns-63.com",
          - "ns-550.awsdns-04.net",
        ] -> null
      - primary_name_server = "ns-550.awsdns-04.net" -> null
      - tags                = {} -> null
      - tags_all            = {} -> null
      - zone_id             = "Z0521747TTLHC74FLK9Z" -> null
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*